// console.log(11);
// let arr = [11, 22, 33];
// console.log(arr);

// Зрозумів різницю між ' та " що вони по суті однакові і використовуються разом тільки для того щоб помістити в себе іншу і відобразити її.
// Не зрозумів до кінця яка суттєва різниця між вище написаними та шаблонного рядка?
// Також яким чином працює ${} - це типу дозволяє не виставляти пробіли руцями чи як?
let a = 'hello';
let b = 'okten';
let c = '!!!';

// let result = a + ' ' + b + ' '+ c;
let result = `${a} ${b} ${c}`;
console.log(result);

// В джс строки, числа та бул є об*єктами також?
// Якщо це примітиви то яким чином ми можемо виклакати на них методи через крапку?
// console.log('asdasd');
// console.log(new String('asdsad'));
// 'asdads'.toUpperCase()


// "Коли доцільно використовувати var, щоб доступ до змінної був завжди?
// Чи це вже просто застарілий метод декларації?
// Також питання по аскі кодах, не дуже зрозуміло як відбувається порівняння string між собою"

console.log(97 === 65);

// "Питання на рахунок синтаксису, типу помітив таку штуку що редактор ніяк не реагує на наявність або відсутність крапки з комою ;
// . Типу чи грає це велику роль як в інших мовах? Чи просто використовується в певних ситуаціях там де це прям необхідно(вимагає синтаксис) ?
// "

// "1. Навіщо потрібні блоки ініціалізації? Просто використала їх в домашці (один загальний на весь код),
// сказали видалити, бо вони не потрібні. Не дуже зрозуміло навіщо вони взагалі.
//
// 2. Як кращє підключати файли скріпта до html документу? На скільки розумію, можна в header, можна в body.
// Стилі завжди у header прописували, то є відчуття, що так правильніше.
// Але ніби в цьому разі не буде можливості доступитись до body,
// бо воно ще не створилося.
// В чому різниця і чи якийсь з варіантів кращий, правильніший? // body
// Ще у тега script можна вказувати атрибут type=""text/javascript"". Цей атрибут потрібен?
// Чому значення text/javascript а не просто jsvascript?"


// Если у меня есть массив arr = [1, 2, 'f', NaN], как мне получить из него только числа?
// При этом я не знаю порядок элементов в массиве, так как данные приходят с сайта.


// Поясніть конвертацію    number в string,  в лекції ви пояснили string в number
console.log(123 + '');
console.log(true + '!!!')
console.log('!' + 10 + 20);

// Як працює інтерпритатор JS? Хоча б в загальному, без складних технічних деталей.
// І приблизно як комунікує з браузером та ОС? Дякую
